БИТУправление_медицинским_центром_демо/src/Catalogs/ДействияМедосмотра/ДействияМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияМедосмотра</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДействийМедицинскогоОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеДействия</name>
    <type>
      <types>CatalogRef.ОграниченияДействийМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьВПрограммеПрохождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.ДействияМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляОтметкиИсследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКабинетаДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаключенияПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>EnumRef.ВидыИсследованийДействийМедосмотра</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ДействияМедосмотровПараметрыАвтозаключений/ДействияМедосмотровПараметрыАвтозаключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДействияМедосмотровПараметрыАвтозаключений</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДействиеМедосмотра</name>
    <type>
      <types>CatalogRef.ДействияМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыДействийМедицинскогоОсмотра/ВидыДействийМедицинскогоОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействийМедицинскогоОсмотра</name>
  <enumValues>
    <name>Врач</name>
  </enumValues>
  <enumValues>
    <name>Исследование</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ДействияМедосмотра/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПечать.Доступность = Объект.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
	
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования;
	Элементы.ТолькоДляОтметкиИсследования.Доступность = Объект.ПечататьВПрограммеПрохождения;
	
	Элементы.ТекстЗаключенияПоУмолчанию.ПодсказкаВвода = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	Элементы.НаименованиеДляПечати.ПодсказкаВвода = Объект.Наименование;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АвтоформированиеЗаключения(Команда)
	
	Оповещение = Новый ОписаниеОповещения("АвтоформированиеЗаключенияПродолжение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтотОбъект,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоформированиеЗаключенияПродолжение(Результат, Параметры) Экспорт
	
	Отбор = Новый Структура("ДействиеМедосмотра", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ДействияМедосмотровПараметрыАвтозаключений.ФормаСписка", ПараметрыФормы, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Элементы.НаименованиеДляПечати.ПодсказкаВвода = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	ЭтоИсследование = Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование");
	
	Элементы.ГруппаПечать.Доступность = ЭтоИсследование;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьВПрограммеПрохожденияПриИзменении(Элемент)
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения;
	Элементы.ТолькоДляОтметкиИсследования.Доступность = Объект.ПечататьВПрограммеПрохождения;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДляОтметкиИсследованияПриИзменении(Элемент)
	Объект.Врач = Неопределено;
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВычислитьДоступностьНомераКабинета(Знач Объект)
	
	Если Объект.Вид <> ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование")
		Или (Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования)
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
